


// 2024-10-15 수업

// 변수 (var , let, const)  3가지 방법이 있음. 근데 우선 let, const만 기억할 것
ㅋ
let a = 10; // a 라는 변수를 선언하고 그 안에 값 10을 저장한다.
let b; // b 변수 선언만 한 것 값을 할당하지 않음
b = 15; // b에 15라는 값을 저장(할당) 한다.
// 10을 a 에 갖다 넣겠다. 라는 뜻
// let let ; 이렇게는 안됨
// let (const) 그리고 이름 을 넣어줘야 함.

// let myschool; 이렇게 하면 안되고 언더바를 이용해서 
// let my_school; 이렇게 해야함 아니면
// let todayLunchTIme  이렇게 대문자를 이용해서 활용해야함. 언더바를 해서 구분 짓는게 편할 듯

// 네임 그대로 일때 

// let memu = 햄버거; << 이러면 안됨
// let memu = "햄버거"; << 이렇게 따옴표 해줘야함 // 문자열 ' "" 둘 중 하나 사용 필수

// 네임이 숫자일때

// let number = 105.123;  따옴표 필요없이 그냥 사용 가능.


//선언 하는건 처음에 한 번만 쓰는거임 선언을 한 번 하면 그 다음부터는 이름만 씀 
//아래 처럼 const cup 했으면 그 다음부터는 그냥 cup = 만 하면 됨. 하지만 변경이 안됨. 

const cup = '콜라';

cup = '콜라';
